# Найти:
# а) сумму кубов всех целых чисел от 20 до 40;
# б) сумму квадратов всех целых чисел от a до 50 (значение a вводится с клавиатуры; 0 a 50);
# в) сумму квадратов всех целых чисел от 1 до n (значение n вводится с клавиатуры; 1 n 100);
# г) сумму квадратов всех целых чисел от a до b (значения a и b вводятся с клавиатуры; b a)

my_list = list(range(20, 41))

cubes_sum = 0
for i in my_list:
    i = i**3
    cubes_sum += i
print(cubes_sum)

#============================================================================

a = int(input("Введите любое целое число от 0 до 50 включительно: "))
my_list = list(range(a, 51))

square_sum = 0
for i in my_list:
    i = i**2
    square_sum += i
print(square_sum)

#============================================================================

n = int(input("Введите любое целое число от 1 до 100 включительно: "))
my_list = list(range(1, n+1))

square_sum = 0
for i in my_list:
    i = i**2
    square_sum += i
print(square_sum)

#============================================================================

a = int(input("Введите любое целое число А: "))
b = int(input("Введите любое целое число B, причем В >= A: "))
my_list = list(range(a, b+1))

square_sum = 0
for i in my_list:
    i = i**2
    square_sum += i
print(square_sum)

#============================================================================
